In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

# Data Cleanup
df["job_posted_date"] = pd.to_datetime(df["job_posted_date"])

In [2]:
df.loc[:, "salary_rate" : "salary_hour_avg"]

       salary_rate  salary_year_avg  salary_hour_avg
0             None              NaN              NaN
1             None              NaN              NaN
2             None              NaN              NaN
3             None              NaN              NaN
4             None              NaN              NaN
...            ...              ...              ...
785736        None              NaN              NaN
785737        None              NaN              NaN
785738        None              NaN              NaN
785739        None              NaN              NaN
785740        None              NaN              NaN

[785741 rows x 3 columns]

In [7]:
median_salary_year = df["salary_year_avg"].median()
median_salary_year

115000.0

In [8]:
median_salary_hour = df["salary_hour_avg"].median()
median_salary_hour

45.97999954223633

In [9]:
df_filled = df

In [14]:
df_filled["salary_hour_avg"] = df_filled["salary_hour_avg"].fillna(median_salary_hour)
df_filled["salary_year_avg"] = df_filled["salary_year_avg"].fillna(median_salary_year)

In [18]:
df_filled.loc[:10, "salary_year_avg":"salary_hour_avg"]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [19]:
df_unique = df_filled

In [23]:
df_unique = df_unique.drop_duplicates()
print("Duplicate length : ",len(df_unique))
print("Original length : ",len(df_filled))
print("droped row : ",len(df_filled) - len(df_unique))

Duplicate length :  785640
Original length :  785741
droped row :  101

In [26]:
df_unique = df_unique.drop_duplicates(subset = ["job_title", "company_name"])

print("Original length : ",len(df_filled))
print("Duplicate length : ",len(df_unique))
print("droped row : ",len(df_filled) - len(df_unique))

Original length :  785741
Duplicate length :  508042
droped row :  277699